RT-Thread/rt-thread/bsp/freescale/platform/hal/src/sim/MKV10Z1287/fsl_sim_hal_MKV10Z1287.c
    switch (instance)
    {
    case 0:
        retValue = SIM_BRD_SOPT7_ADC0ALTTRGEN(base);
        break;
    case 1:
        retValue = SIM_BRD_SOPT7_ADC1ALTTRGEN(base);
        break;
    default:
        retValue = false;
        break;
    }

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetAdcAlternativeTriggerMode
 * Description   : Sets the ADCx alternate trigger select setting
 * This function selects the alternative conversion triggers for ADCx
 *
 *END**************************************************************************/
void SIM_HAL_SetAdcAlternativeTriggerMode(SIM_Type * base,
                                         uint32_t instance,
                                         sim_adc_alttrg_sel_t select)
{
    assert(instance < ADC_INSTANCE_COUNT);

    switch (instance)
    {
    case 0:
        SIM_BWR_SOPT7_ADC0ALTTRGEN(base, select);
        break;
    case 1:
        SIM_BWR_SOPT7_ADC1ALTTRGEN(base, select);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetAdcAlternativeTriggerMode
 * Description   : Gets the ADCx alternate trigger select setting
 * This function gets the ADCx alternate trigger select setting
 *
 *END**************************************************************************/
sim_adc_alttrg_sel_t SIM_HAL_GetAdcAlternativeTriggerMode(SIM_Type * base,
                                                  uint32_t instance)
{
    sim_adc_alttrg_sel_t retValue = (sim_adc_alttrg_sel_t)0;

    assert(instance < ADC_INSTANCE_COUNT);

    switch (instance)
    {
    case 0:
        retValue = (sim_adc_alttrg_sel_t)SIM_BRD_SOPT7_ADC0ALTTRGEN(base);
        break;
    case 1:
        retValue = (sim_adc_alttrg_sel_t)SIM_BRD_SOPT7_ADC1ALTTRGEN(base);
        break;
    default:
        break;
    }

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetAdcPreTriggerMode
 * Description   : Set ADCx pre-trigger select setting
 * This function will select the ADCx pre-trigger source when alternative
 * triggers are enabled through ADCxALTTRGEN
 *
 *END**************************************************************************/
void SIM_HAL_SetAdcPreTriggerMode(SIM_Type * base,
                                  uint32_t instance,
                                  sim_adc_pretrg_sel_t select)
{
    assert(instance < ADC_INSTANCE_COUNT);

    switch (instance)
    {
    case 0:
        SIM_BWR_SOPT7_ADC0PRETRGSEL(base, select);
        break;
    case 1:
        SIM_BWR_SOPT7_ADC1PRETRGSEL(base, select);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetAdcPreTriggerMode
 * Description   : Get ADCx pre-trigger select setting
 * This function will get ADCx pre-trigger select setting.
 *
 *END**************************************************************************/
sim_adc_pretrg_sel_t SIM_HAL_GetAdcPreTriggerMode(SIM_Type * base,
                                                  uint32_t instance)
{
    sim_adc_pretrg_sel_t retValue = (sim_adc_pretrg_sel_t)0;

    assert(instance < ADC_INSTANCE_COUNT);

    switch (instance)
    {
    case 0:
        retValue = (sim_adc_pretrg_sel_t)SIM_BRD_SOPT7_ADC0PRETRGSEL(base);
        break;
    case 1:
        retValue = (sim_adc_pretrg_sel_t)SIM_BRD_SOPT7_ADC1PRETRGSEL(base);
        break;
    default:
        break;
    }

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetAdcTriggerMode
 * Description   : Set ADCx trigger select setting
 * This function will select the ADCx trigger source when alternative triggers
 * are enabled through ADCxALTTRGEN
 *
 *END**************************************************************************/
void SIM_HAL_SetAdcTriggerMode(SIM_Type * base,
                               uint32_t instance,
                               sim_adc_trg_sel_t select)
{
    assert(instance < ADC_INSTANCE_COUNT);

    switch (instance)
    {
    case 0:
        SIM_BWR_SOPT7_ADC0TRGSEL(base, select);
        break;
    case 1:
        SIM_BWR_SOPT7_ADC1TRGSEL(base, select);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetAdcTriggerMode
 * Description   : Get ADCx trigger select setting
 * This function will get ADCx trigger select setting.
 *
 *END**************************************************************************/
sim_adc_trg_sel_t SIM_HAL_GetAdcTriggerMode(SIM_Type * base, uint32_t instance)
{
    sim_adc_trg_sel_t retValue = (sim_adc_trg_sel_t)0;

    assert(instance < ADC_INSTANCE_COUNT);

    switch (instance)
    {
    case 0:
        retValue = (sim_adc_trg_sel_t)SIM_BRD_SOPT7_ADC0TRGSEL(base);
        break;
    case 1:
        retValue = (sim_adc_trg_sel_t)SIM_BRD_SOPT7_ADC1TRGSEL(base);
        break;
    default:
        break;
    }

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetAdcTriggerModeOneStep
 * Description   : Set ADCx trigger setting.
 * This function sets ADC alternate trigger mode, pre-trigger mode and trigger mode.
 *
 *END**************************************************************************/
void SIM_HAL_SetAdcTriggerModeOneStep(SIM_Type * base,
                                      uint32_t instance,
                                      sim_adc_alttrg_sel_t altTrigSel,
                                      sim_adc_pretrg_sel_t preTrigSel,
                                      sim_adc_trg_sel_t trigSel)
{
    assert(instance < ADC_INSTANCE_COUNT);

    switch (instance)
    {
        case 0:
            SIM_BWR_SOPT7_ADC0ALTTRGEN(base, altTrigSel);
            SIM_BWR_SOPT7_ADC0PRETRGSEL(base, preTrigSel);
            break;
        case 1:
            SIM_BWR_SOPT7_ADC1ALTTRGEN(base, altTrigSel);
            SIM_BWR_SOPT7_ADC1PRETRGSEL(base, preTrigSel);
            break;
    default:
        break;
    }

    if (altTrigSel == kSimAdcAltTrgselALT)
    {
        switch (instance)
        {
            case 0:
                SIM_BWR_SOPT7_ADC0TRGSEL(base, trigSel);
                break;
            case 1:
                SIM_BWR_SOPT7_ADC1TRGSEL(base, trigSel);
                break;
            default:
                break;
        }
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetWdogClkSrc
 * Description   : WDOG Clock Select
 * This function selects the clock source of the WDOG2008 watchdog.
 * 0 Internal 1 kHz clock is source to WDOG2008
 * 1 MCGIRCLK is source to WDOG2008
 *
 *END**************************************************************************/
void SIM_HAL_SetWdogClkSrc(SIM_Type* base, bool select)
{
        SIM_BWR_WDOGC_WDOGCLKS(base, select);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetWdogClkSrc
 * Description   : Get WDOG Clock setting
 * This function will get the clock source of the WDOG2008 watchdog
 *
 *END**************************************************************************/
bool SIM_HAL_GetWdogClkSrc(SIM_Type* base)
{
    return (bool)SIM_BRD_WDOGC_WDOGCLKS(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetUartOpenDrainMode
 * Description   : Sets the UARTx open drain enable setting.
 * This function enables/disables open drain for UARTx.
 *
 *END**************************************************************************/
void SIM_HAL_SetUartOpenDrainMode(SIM_Type * base,
                                  uint32_t instance,
                                  bool enable)
{
    assert(instance < UART_INSTANCE_COUNT);
    switch(instance)
    {
        case 0:
          SIM_BWR_SOPT5_UART0ODE(base, enable ? 1 : 0);
          break;
        case 1:
          SIM_BWR_SOPT5_UART1ODE(base, enable ? 1 : 0);
          break;
        default:
          break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetUartOpenDrainMode
 * Description   : Gets the UARTx open drain enable setting.
 * This function Gets the UARTx open drain enable setting for UARTx.
 *
 *END**************************************************************************/
bool SIM_HAL_GetUartOpenDrainMode(SIM_Type * base, uint32_t instance)
{
    bool retValue = false;
    assert(instance < UART_INSTANCE_COUNT);
    switch(instance)
    {
        case 0:
          retValue = SIM_BRD_SOPT5_UART0ODE(base);
          break;
        case 1:
          retValue = SIM_BRD_SOPT5_UART1ODE(base);
          break;
        default:
          retValue = false;
          break;
    }
    return retValue;
}
                
/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetUartRxSrcMode
 * Description   : Set UARTx receive data source select setting
 * This function will select the source for the UART1 receive data.
 *
 *END**************************************************************************/
void SIM_HAL_SetUartRxSrcMode(SIM_Type * base,
                              uint32_t instance,
                              sim_uart_rxsrc_t select)
{
    assert(instance < FSL_FEATURE_SIM_OPT_UART_COUNT);

