RT-Thread/rt-thread/bsp/freescale/platform/hal/src/sim/MKV10Z1287/fsl_sim_hal_MKV10Z1287.c
    switch (instance)
    {
    case 0:
        SIM_BWR_SOPT5_UART0RXSRC(base, select);
        break;
    case 1:
        SIM_BWR_SOPT5_UART1RXSRC(base, select);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetUartRxSrcMode
 * Description   : Get UARTx receive data source select setting
 * This function will get UARTx receive data source select setting.
 *
 *END**************************************************************************/
sim_uart_rxsrc_t SIM_HAL_GetUartRxSrcMode(SIM_Type * base, uint32_t instance)
{
    sim_uart_rxsrc_t retValue = (sim_uart_rxsrc_t)0;

    assert(instance < FSL_FEATURE_SIM_OPT_UART_COUNT);

    switch (instance)
    {
    case 0:
        retValue = (sim_uart_rxsrc_t)SIM_BRD_SOPT5_UART0RXSRC(base);
        break;
    case 1:
        retValue = (sim_uart_rxsrc_t)SIM_BRD_SOPT5_UART1RXSRC(base);
        break;
    default:
        break;
    }

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetUartTxSrcMode
 * Description   : Set UARTx transmit data source select setting
 * This function will select the source for the UARTx transmit data.
 *
 *END**************************************************************************/
void SIM_HAL_SetUartTxSrcMode(SIM_Type * base,
                              uint32_t instance,
                              sim_uart_txsrc_t select)
{
    assert(instance < FSL_FEATURE_SIM_OPT_UART_COUNT);

    switch (instance)
    {
    case 0:
        SIM_BWR_SOPT5_UART0TXSRC(base, select);
        break;
    case 1:
        SIM_BWR_SOPT5_UART1TXSRC(base, select);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetUartTxSrcMode
 * Description   : Get UARTx transmit data source select setting
 * This function will get UARTx transmit data source select setting.
 *
 *END**************************************************************************/
sim_uart_txsrc_t SIM_HAL_GetUartTxSrcMode(SIM_Type * base, uint32_t instance)
{
    sim_uart_txsrc_t retValue =(sim_uart_txsrc_t)0;

    assert(instance < FSL_FEATURE_SIM_OPT_UART_COUNT);

    switch (instance)
    {
    case 0:
        retValue = (sim_uart_txsrc_t)SIM_BRD_SOPT5_UART0TXSRC(base);
        break;
    case 1:
        retValue = (sim_uart_txsrc_t)SIM_BRD_SOPT5_UART1TXSRC(base);
        break;
    default:
        break;
    }

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetFtmTriggerSrcMode
 * Description   : Set FlexTimer x hardware trigger y source select setting
 * This function will select the source of FTMx hardware trigger y.
 *
 *END**************************************************************************/
void SIM_HAL_SetFtmTriggerSrcMode(SIM_Type * base,
                                  uint32_t instance,
                                  uint8_t  trigger,
                                  sim_ftm_trg_src_t select)
{
    assert (instance < FTM_INSTANCE_COUNT);
    assert (trigger < FSL_FEATURE_SIM_OPT_FTM_TRIGGER_COUNT);

    switch (instance)
    {
    case 0:
        switch (trigger)
        {
        case 0:
            SIM_BWR_SOPT4_FTM0TRG0SRC(base, select);
            break;
        case 1:
            SIM_BWR_SOPT4_FTM0TRG1SRC(base, select);
            break;
        case 2:
            SIM_BWR_SOPT4_FTM0TRG2SRC(base, select);
            break;
        default:
            break;
        }
        break;
    case 1:
        switch (trigger)
        {
        case 0:
            SIM_BWR_SOPT4_FTM1TRG0SRC(base, select);
            break;
        case 1:
            SIM_BWR_SOPT4_FTM1TRG1SRC(base, select);
            break;
        case 2:
            SIM_BWR_SOPT4_FTM1TRG2SRC(base, select);
            break;
        default:
            break;
        }
        break;
    case 2:
        switch (trigger)
        {
        case 0:
            SIM_BWR_SOPT4_FTM2TRG0SRC(base, select);
            break;
        case 1:
            SIM_BWR_SOPT4_FTM2TRG1SRC(base, select);
            break;
        case 2:
            SIM_BWR_SOPT4_FTM2TRG2SRC(base, select);
            break;
        default:
            break;
        }
        break;
    case 3:
        switch (trigger)
        {
        case 0:
            SIM_BWR_SOPT6_FTM3TRG0SRC(base, select);
            break;
        case 1:
            SIM_BWR_SOPT6_FTM3TRG1SRC(base, select);
            break;
        case 2:
            SIM_BWR_SOPT6_FTM3TRG2SRC(base, select);
            break;
        default:
            break;
        }
        break;
    case 4:
        switch (trigger)
        {
        case 0:
            SIM_BWR_SOPT6_FTM4TRG0SRC(base, select);
            break;
        case 1:
            SIM_BWR_SOPT6_FTM4TRG1SRC(base, select);
            break;
        case 2:
            SIM_BWR_SOPT6_FTM4TRG2SRC(base, select);
            break;
        default:
            break;
        }
        break;
    case 5:
        switch (trigger)
        {
        case 0:
            SIM_BWR_SOPT6_FTM5TRG0SRC(base, select);
            break;
        case 1:
            SIM_BWR_SOPT6_FTM5TRG1SRC(base, select);
            break;
        case 2:
            SIM_BWR_SOPT6_FTM5TRG2SRC(base, select);
            break;
        default:
            break;
        }
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetFtmTriggerSrcMode
 * Description   : Get FlexTimer x hardware trigger y source select setting
 * This function will get FlexTimer x hardware trigger y source select setting.
 *
 *END**************************************************************************/
sim_ftm_trg_src_t SIM_HAL_GetFtmTriggerSrcMode(SIM_Type * base,
                                               uint32_t instance,
                                               uint8_t trigger)
{
    sim_ftm_trg_src_t retValue = (sim_ftm_trg_src_t)0;

    assert (instance < FTM_INSTANCE_COUNT);
    assert (trigger < FSL_FEATURE_SIM_OPT_FTM_TRIGGER_COUNT);

