RT-Thread/rt-thread/bsp/freescale/platform/hal/src/sim/MKV10Z1287/fsl_sim_hal_MKV10Z1287.c
    switch (instance)
    {
    case 1:
        switch (channel)
        {
        case 0:
            retValue = (sim_ftm_ch_src_t)SIM_BRD_SOPT4_FTM1CH0SRC(base);
            break;
        default:
            break;
        }
        break;
    case 2:
        switch (channel)
        {
        case 0:
            retValue = (sim_ftm_ch_src_t)SIM_BRD_SOPT4_FTM2CH0SRC(base);
            break;
        case 1:
            retValue = (sim_ftm_ch_src_t)SIM_BRD_SOPT4_FTM2CH1SRC(base);
            break;
        default:
            break;
        }
        break;
    case 4:
        switch (channel)
        {
        case 0:
            retValue = (sim_ftm_ch_src_t)SIM_BRD_SOPT6_FTM4CH0SRC(base);
            break;
        default:
            break;
        }
        break;
    case 5:
        switch (channel)
        {
        case 0:
            retValue = (sim_ftm_ch_src_t)SIM_BRD_SOPT6_FTM5CH0SRC(base);
            break;
        default:
            break;
        }
        break;
    default:
        break;
    }

    return retValue;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetFtmChOutSrcMode
 * Description   : FlexTimer x channel y output source select setting.
 * This function will select FlexTimer x channel y output source
 *
 *END**************************************************************************/
void SIM_HAL_SetFtmChOutSrcMode(SIM_Type * base,
                                uint32_t instance,
                                uint8_t channel,
                                sim_ftm_ch_out_src_t select)
{
    assert ((0U==instance) || (2U==instance) || (3U==instance) || (4U==instance));
    assert (6U>channel);

    switch (instance)
    {
    case 0:
        switch (channel)
        {
        case 0:
            SIM_BWR_SOPT8_FTM0OCH0SRC(base, select);
            break;
        case 1:
            SIM_BWR_SOPT8_FTM0OCH1SRC(base, select);
            break;
        case 2:
            SIM_BWR_SOPT8_FTM0OCH2SRC(base, select);
            break;
        case 3:
            SIM_BWR_SOPT8_FTM0OCH3SRC(base, select);
            break;
        case 4:
            SIM_BWR_SOPT8_FTM0OCH4SRC(base, select);
            break;
        case 5:
            SIM_BWR_SOPT8_FTM0OCH5SRC(base, select);
            break;
        default:
            break;
        }
        break;
    case 2:
        switch (channel)
        {
        case 0:
            SIM_BWR_SOPT8_FTM2OCH0SRC(base, select);
            break;
        case 1:
            SIM_BWR_SOPT8_FTM2OCH1SRC(base, select);
            break;
        default:
            break;
        }
        break;
    case 3:
        switch (channel)
        {
        case 0:
            SIM_BWR_SOPT9_FTM3OCH0SRC(base, select);
            break;
        case 1:
            SIM_BWR_SOPT9_FTM3OCH1SRC(base, select);
            break;
        case 2:
            SIM_BWR_SOPT9_FTM3OCH2SRC(base, select);
            break;
        case 3:
            SIM_BWR_SOPT9_FTM3OCH3SRC(base, select);
            break;
        case 4:
            SIM_BWR_SOPT9_FTM3OCH4SRC(base, select);
            break;
        case 5:
            SIM_BWR_SOPT9_FTM3OCH5SRC(base, select);
            break;
        default:
            break;
        }
        break;
    case 4:
        switch (channel)
        {
        case 0:
            SIM_BWR_SOPT9_FTM4OCH0SRC(base, select);
            break;
        case 1:
            SIM_BWR_SOPT9_FTM4OCH1SRC(base, select);
            break;
        default:
            break;
        }
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetFtmChOutSrcMode
 * Description   : Get FlexTimer x channel y output source select setting
 * This function will get FlexTimer x channel y output source select
 * setting.
 *
 *END**************************************************************************/
sim_ftm_ch_out_src_t SIM_HAL_GetFtmChOutSrcMode(SIM_Type * base,
                                                uint32_t instance,
                                                uint8_t channel)
{
    sim_ftm_ch_out_src_t retValue = (sim_ftm_ch_out_src_t)0;

    assert ((0U==instance) || (2U==instance) || (3U==instance) || (4U==instance));
    assert (6U>channel);

    switch (instance)
    {
    case 0:
        switch (channel)
        {
        case 0:
            retValue = (sim_ftm_ch_out_src_t)SIM_BRD_SOPT8_FTM0OCH0SRC(base);
            break;
        case 1:
            retValue = (sim_ftm_ch_out_src_t)SIM_BRD_SOPT8_FTM0OCH1SRC(base);
            break;
        case 2:
            retValue = (sim_ftm_ch_out_src_t)SIM_BRD_SOPT8_FTM0OCH2SRC(base);
            break;
        case 3:
            retValue = (sim_ftm_ch_out_src_t)SIM_BRD_SOPT8_FTM0OCH3SRC(base);
            break;
        case 4:
            retValue = (sim_ftm_ch_out_src_t)SIM_BRD_SOPT8_FTM0OCH4SRC(base);
            break;
        case 5:
            retValue = (sim_ftm_ch_out_src_t)SIM_BRD_SOPT8_FTM0OCH5SRC(base);
            break;
        default:
            break;
        }
        break;
    case 2:
        switch (channel)
        {
        case 0:
            retValue = (sim_ftm_ch_out_src_t)SIM_BRD_SOPT8_FTM2OCH0SRC(base);
            break;
        case 1:
            retValue = (sim_ftm_ch_out_src_t)SIM_BRD_SOPT8_FTM2OCH1SRC(base);
            break;
        default:
            break;
        }
        break;
    case 3:
        switch (channel)
        {
        case 0:
            retValue = (sim_ftm_ch_out_src_t)SIM_BRD_SOPT9_FTM3OCH0SRC(base);
            break;
        case 1:
            retValue = (sim_ftm_ch_out_src_t)SIM_BRD_SOPT9_FTM3OCH1SRC(base);
            break;
        case 2:
            retValue = (sim_ftm_ch_out_src_t)SIM_BRD_SOPT9_FTM3OCH2SRC(base);
            break;
        case 3:
            retValue = (sim_ftm_ch_out_src_t)SIM_BRD_SOPT9_FTM3OCH3SRC(base);
            break;
        case 4:
            retValue = (sim_ftm_ch_out_src_t)SIM_BRD_SOPT9_FTM3OCH4SRC(base);
            break;
        case 5:
            retValue = (sim_ftm_ch_out_src_t)SIM_BRD_SOPT9_FTM3OCH5SRC(base);
            break;
        default:
            break;
        }
        break;
    case 4:
        switch (channel)
        {
        case 0:
            retValue = (sim_ftm_ch_out_src_t)SIM_BRD_SOPT9_FTM4OCH0SRC(base);
            break;
        case 1:
            retValue = (sim_ftm_ch_out_src_t)SIM_BRD_SOPT9_FTM4OCH1SRC(base);
            break;
        default:
            break;
        }
        break;
    default:
        break;
    }

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetFtmSyncCmd
 * Description   : Set FTMxSYNCBIT
 * This function sets FlexTimer x hardware trigger 0 software synchronization.
 *
 *END**************************************************************************/
void SIM_HAL_SetFtmSyncCmd(SIM_Type * base, uint32_t instance, bool sync)
{
    assert (instance < FTM_INSTANCE_COUNT);
    if (sync)
    {
        SIM_SET_SOPT8(base, (1U<<instance));
    }
    else
    {
        SIM_CLR_SOPT8(base, (1U<<instance));
    }
}
      
/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetFtmFaultSelMode
 * Description   : Set FlexTimer x fault y select setting
 * This function will set the FlexTimer x fault y select setting.
 *
 *END**************************************************************************/
void SIM_HAL_SetFtmFaultSelMode(SIM_Type * base,
                                uint32_t instance,
                                uint8_t  fault,
                                sim_ftm_flt_sel_t select)
{
    assert (instance < FTM_INSTANCE_COUNT);

