RT-Thread/rt-thread/bsp/freescale/platform/hal/src/sim/MKV10Z1287/fsl_sim_hal_MKV10Z1287.c
    switch (instance)
    {
    case 0:
        switch (fault)
        {
            case 0:
                SIM_BWR_SOPT4_FTM0FLT0(base, select);
                break;
            case 1:
                SIM_BWR_SOPT4_FTM0FLT1(base, select);
                break;
            default:
                break;
        }
        break;
    case 1:
        SIM_BWR_SOPT4_FTM1FLT0(base, select);
        break;
    case 2:
        SIM_BWR_SOPT4_FTM2FLT0(base, select);
        break;
    case 3:
        SIM_BWR_SOPT6_FTM3FLT0(base, select);
        break;
    case 4:
        SIM_BWR_SOPT6_FTM4FLT0(base, select);
        break;
    case 5:
        SIM_BWR_SOPT6_FTM5FLT0(base, select);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetFtmFaultSelMode
 * Description   : Get FlexTimer x fault y select setting
 * This function will get FlexTimer x fault y select setting.
 *
 *END**************************************************************************/
sim_ftm_flt_sel_t SIM_HAL_GetFtmFaultSelMode(SIM_Type * base,
                                             uint32_t instance,
                                             uint8_t fault)
{
    sim_ftm_flt_sel_t retValue = (sim_ftm_flt_sel_t)0;

    assert (instance < FTM_INSTANCE_COUNT);

    switch (instance)
    {
    case 0:
        switch (fault)
        {
            case 0:
                retValue = (sim_ftm_flt_sel_t)SIM_BRD_SOPT4_FTM0FLT0(base);
                break;
            case 1:
                retValue = (sim_ftm_flt_sel_t)SIM_BRD_SOPT4_FTM0FLT1(base);
                break;
            default:
                break;
        }
        break;
    case 1:
        retValue = (sim_ftm_flt_sel_t)SIM_BRD_SOPT4_FTM1FLT0(base);
        break;
    case 2:
        retValue = (sim_ftm_flt_sel_t)SIM_BRD_SOPT4_FTM2FLT0(base);
        break;
    case 3:
        retValue = (sim_ftm_flt_sel_t)SIM_BRD_SOPT6_FTM3FLT0(base);
        break;
    case 4:
        retValue = (sim_ftm_flt_sel_t)SIM_BRD_SOPT6_FTM4FLT0(base);
        break;
    case 5:
        retValue = (sim_ftm_flt_sel_t)SIM_BRD_SOPT6_FTM5FLT0(base);
        break;
    default:
        break;
    }

    return retValue;
}

/*******************************************************************************
 * EOF
 ******************************************************************************/

